#language: ru

  Функционал: Баннеры курсов на главной странице OTUS

    @Courses
    Сценарий: Выбор баннера по названию курса
      Пусть Я открываю страницу https://otus.ru/ в браузере chrome
      Если Кликнуть на баннер курса с названием Developer
      Тогда Откроется страница курса с залоговком содержащим Developer

    @Courses
    Сценарий: Поиск курсов, стартующих с указанной даты
      Пусть Я открываю страницу https://otus.ru/ в браузере chrome
      Если Выбрать курсы стартующие с 01.05.2023
